In [1]:
import pandas as pd
from pandas import DataFrame

In [18]:
filepath = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\oecd_tourism.csv"

tourism_df = pd.read_csv(filepath, usecols=['LOCATION', 'SUBJECT', 'TIME', 'Value'])

In [19]:
tourism_df

     LOCATION  SUBJECT  TIME      Value
0         AUS  INT_REC  2008  31159.800
1         AUS  INT_REC  2009  29980.700
2         AUS  INT_REC  2010  35165.500
3         AUS  INT_REC  2011  38710.100
4         AUS  INT_REC  2012  38003.700
...       ...      ...   ...        ...
1229      SRB  INT-EXP  2015   1253.644
1230      SRB  INT-EXP  2016   1351.098
1231      SRB  INT-EXP  2017   1549.183
1232      SRB  INT-EXP  2018   1837.317
1233      SRB  INT-EXP  2019   1999.313

[1234 rows x 4 columns]

In [20]:
tourism_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1234 entries, 0 to 1233
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   LOCATION  1234 non-null   object
 1   SUBJECT   1234 non-null   object
 2   TIME      1234 non-null   int64
 3   Value     1234 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 38.7+ KB

In [21]:
tourism_df['LOCATION'].value_counts()

LOCATION
AUS    24
IDN    24
BRA    24
BGR    24
CHL    24
COL    24
CRI    24
HRV    24
EGY    24
IND    24
ISR    24
CHE    24
MLT    24
MAR    24
PER    24
PHL    24
ROU    24
ZAF    24
CHN    24
KAZ    24
USA    24
SRB    24
CAN    24
NZL    24
JPN    24
PRT    22
ISL    22
BEL    22
CZE    22
SVN    22
RUS    22
DNK    22
FIN    22
FRA    22
DEU    22
GRC    22
LVA    22
HUN    22
IRL    22
SVK    22
EST    22
ITA    22
KOR    22
LUX    22
MEX    22
NLD    22
NOR    22
GBR    22
AUT    22
POL    22
SWE    22
ESP    22
TUR    22
LTU    18
Name: count, dtype: int64

In [22]:
tourism_df['SUBJECT'].value_counts()

SUBJECT
INT_REC    617
INT-EXP    617
Name: count, dtype: int64

In [24]:
tourism_df['TIME'].value_counts()

TIME
2010    108
2011    108
2012    108
2013    108
2014    108
2015    108
2016    108
2017    108
2018    108
2009    106
2008    104
2019     52
Name: count, dtype: int64

Find the five countries that received the greatest amount of tourist dollars, on average, across years in the data set.

In [26]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT_REC']
    ['Value']
    .mean()
)

18876.11070502431

In [ ]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT_REC']
    .groupby('LOCATION')['Value']
    .mean()
)

LOCATION
AUS     38540.900000
AUT     21413.209091
BEL     12190.591636
BGR      4343.541417
BRA      6321.476083
CAN     24202.591667
CHE     16481.041667
CHL      3163.441667
CHN     43554.309417
COL      4778.975000
CRI      3174.100000
CZE      7909.922273
DEU     53408.570636
DNK      9398.957636
EGY      9850.430833
ESP     69655.817364
EST      1848.067364
FIN      4700.236273
FRA     65063.335727
GBR     51752.090909
GRC     16908.736000
HRV      9286.770000
HUN      7299.353000
IDN     11484.960000
IND     20606.844083
IRL     10535.157364
ISL      2397.367455
ISR      6542.383250
ITA     44930.211545
JPN     25015.858333
KAZ      1979.881333
KOR     17780.754545
LTU      1426.155556
LUX      5122.330727
LVA      1215.036364
MAR      8684.227500
MEX     16564.354545
MLT      1607.669250
NLD     20042.627273
NOR      5188.772727
NZL      9593.466667
PER      3596.176667
PHL      5910.688833
POL     12231.065182
PRT     16470.353909
ROU      2340.742833
RUS     16131.481818
SRB      1356.921333
SVK      2683.343727
SVN      2913.229364
SWE     13373.514000
TUR     31582.090909
USA    201613.500000
ZAF      9794.813167
Name: Value, dtype: float64

Find the five countries whose citizens spent the least amount of tourist dollars, on average, across years in the data set.

In [38]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT-EXP']
    .groupby('LOCATION')['Value']
    .mean()
    .sort_values(ascending=False)
    .head()
)

LOCATION
CHN    163217.404417
USA    142080.666667
DEU     96615.075545
GBR     75262.227273
FRA     51394.272273
Name: Value, dtype: float64

In [29]:
(
    tourism_df
    .loc[tourism_df['SUBJECT'] == 'INT-EXP']
    .groupby('LOCATION')['Value']
    .mean()
    .sort_values()
    .head()
)

LOCATION
MLT     387.801667
CRI     867.075000
LVA     919.545455
ISL    1072.819636
HRV    1115.628083
Name: Value, dtype: float64

The separate CSV file oecd_locations.csv has two columns: one contains the three-letter abbreviated location name from the first CSV file, and the second is the full country name. Load this into a data frame, using the abbreviated data as an index.

In [30]:
locations_filename = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\oecd_locations.csv"
locations_df = pd.read_csv(locations_filename,
                        header=None,
                        names=['LOCATION', 'NAME'],
                        index_col='LOCATION')

In [31]:
locations_df

                    NAME
LOCATION
AUS            Australia
AUT              Austria
BEL              Belgium
CAN               Canada
DNK              Denmark
FIN              Finland
FRA               France
DEU              Germany
HUN              Hungary
ITA                Italy
JPN                Japan
KOR                Korea
GBR       United Kingdom
USA        United States
BRA               Brazil
ISR               Israel

Join these two data frames together into a new one. In the new data frame, there is no LOCATION column. Instead, there is a name column with the full name of the country.

In [34]:
fullname_df = locations_df.join(tourism_df.set_index('LOCATION'))
fullname_df

               NAME  SUBJECT  TIME    Value
LOCATION
AUS       Australia  INT_REC  2008  31159.8
AUS       Australia  INT_REC  2009  29980.7
AUS       Australia  INT_REC  2010  35165.5
AUS       Australia  INT_REC  2011  38710.1
AUS       Australia  INT_REC  2012  38003.7
...             ...      ...   ...      ...
ISR          Israel  INT-EXP  2015   7507.0
ISR          Israel  INT-EXP  2016   8210.3
ISR          Israel  INT-EXP  2017   8986.0
ISR          Israel  INT-EXP  2018   9974.7
ISR          Israel  INT-EXP  2019  10389.5

[364 rows x 4 columns]

In [ ]:
# Create a new (anonymous) data frame based on tourism_df, whose index is set to LOCATION.
# Run join on locations_df and the new LOCATION-indexed version of tourism_df.
# # Assign this to a new data frame, which we call fullname_df.

Rerun the queries from steps 2 and 3, finding the five countries that spent and received the most, on average, from tourism. But this time, get the name of each country, rather than its abbreviation, for your reports.

In [36]:
(
    fullname_df
    .loc[fullname_df['SUBJECT'] == 'INT-EXP']
    .groupby('NAME')['Value']
    .mean()
    .sort_values()
    .head()
)

NAME
Hungary     2918.390182
Finland     5877.080909
Israel      6726.524833
Denmark    11326.169636
Austria    11934.563636
Name: Value, dtype: float64

In [37]:
(
    fullname_df
    .loc[fullname_df['SUBJECT'] == 'INT-EXP']
    .groupby('NAME')['Value']
    .mean()
    .sort_values(ascending=False)
    .head()
)

NAME
United States     142080.666667
Germany            96615.075545
United Kingdom     75262.227273
France             51394.272273
Canada             40984.633333
Name: Value, dtype: float64

Ignoring the names, did you get the same results as before? Why or why not?